; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=410, out_folder=./training, instance_id=29, seed=2053, goal_proportion=0.03

(define (problem blocksworld-29)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 b370 b371 b372 b373 b374 b375 b376 b377 b378 b379 b380 b381 b382 b383 b384 b385 b386 b387 b388 b389 b390 b391 b392 b393 b394 b395 b396 b397 b398 b399 b400 b401 b402 b403 b404 b405 b406 b407 b408 b409 b410 - object)
 (:init 
    (arm-empty)
    (clear b187)
    (on-table b187)
    (clear b167)
    (on b167 b148)
    (on b148 b312)
    (on b312 b219)
    (on b219 b183)
    (on-table b183)
    (clear b224)
    (on b224 b59)
    (on b59 b405)
    (on b405 b200)
    (on b200 b267)
    (on b267 b406)
    (on b406 b408)
    (on b408 b235)
    (on-table b235)
    (clear b69)
    (on b69 b113)
    (on-table b113)
    (clear b284)
    (on b284 b258)
    (on b258 b244)
    (on b244 b192)
    (on b192 b222)
    (on b222 b377)
    (on b377 b313)
    (on b313 b214)
    (on-table b214)
    (clear b1)
    (on b1 b8)
    (on b8 b321)
    (on b321 b242)
    (on-table b242)
    (clear b32)
    (on b32 b352)
    (on b352 b68)
    (on b68 b289)
    (on b289 b359)
    (on b359 b108)
    (on b108 b161)
    (on-table b161)
    (clear b338)
    (on b338 b373)
    (on b373 b84)
    (on b84 b299)
    (on b299 b339)
    (on b339 b138)
    (on b138 b125)
    (on b125 b85)
    (on b85 b184)
    (on-table b184)
    (clear b133)
    (on b133 b340)
    (on b340 b91)
    (on b91 b147)
    (on b147 b409)
    (on b409 b247)
    (on b247 b328)
    (on b328 b250)
    (on b250 b381)
    (on b381 b213)
    (on b213 b229)
    (on b229 b120)
    (on b120 b2)
    (on b2 b19)
    (on-table b19)
    (clear b75)
    (on-table b75)
    (clear b118)
    (on b118 b226)
    (on b226 b151)
    (on-table b151)
    (clear b38)
    (on b38 b295)
    (on b295 b88)
    (on b88 b76)
    (on b76 b10)
    (on b10 b407)
    (on b407 b196)
    (on-table b196)
    (clear b232)
    (on-table b232)
    (clear b195)
    (on-table b195)
    (clear b64)
    (on b64 b252)
    (on-table b252)
    (clear b156)
    (on b156 b73)
    (on b73 b4)
    (on b4 b399)
    (on b399 b228)
    (on b228 b83)
    (on b83 b45)
    (on-table b45)
    (clear b158)
    (on b158 b356)
    (on b356 b199)
    (on b199 b82)
    (on b82 b105)
    (on b105 b327)
    (on b327 b170)
    (on b170 b5)
    (on b5 b253)
    (on b253 b203)
    (on-table b203)
    (clear b52)
    (on-table b52)
    (clear b268)
    (on b268 b164)
    (on-table b164)
    (clear b372)
    (on-table b372)
    (clear b398)
    (on-table b398)
    (clear b179)
    (on-table b179)
    (clear b210)
    (on-table b210)
    (clear b188)
    (on b188 b62)
    (on-table b62)
    (clear b176)
    (on b176 b3)
    (on-table b3)
    (clear b329)
    (on b329 b112)
    (on b112 b193)
    (on-table b193)
    (clear b11)
    (on b11 b274)
    (on-table b274)
    (clear b136)
    (on b136 b42)
    (on-table b42)
    (clear b191)
    (on b191 b257)
    (on-table b257)
    (clear b285)
    (on-table b285)
    (clear b394)
    (on b394 b97)
    (on b97 b241)
    (on b241 b110)
    (on b110 b358)
    (on-table b358)
    (clear b175)
    (on-table b175)
    (clear b71)
    (on b71 b14)
    (on b14 b22)
    (on b22 b387)
    (on b387 b349)
    (on b349 b283)
    (on b283 b180)
    (on b180 b166)
    (on-table b166)
    (clear b204)
    (on b204 b13)
    (on b13 b165)
    (on-table b165)
    (clear b314)
    (on b314 b296)
    (on b296 b348)
    (on b348 b43)
    (on b43 b23)
    (on b23 b343)
    (on b343 b262)
    (on-table b262)
    (clear b259)
    (on-table b259)
    (clear b123)
    (on b123 b12)
    (on b12 b16)
    (on-table b16)
    (clear b345)
    (on b345 b93)
    (on b93 b291)
    (on b291 b79)
    (on b79 b86)
    (on b86 b351)
    (on b351 b163)
    (on b163 b116)
    (on b116 b169)
    (on b169 b144)
    (on b144 b181)
    (on b181 b95)
    (on b95 b25)
    (on-table b25)
    (clear b107)
    (on b107 b208)
    (on-table b208)
    (clear b51)
    (on b51 b336)
    (on b336 b154)
    (on b154 b41)
    (on b41 b142)
    (on b142 b65)
    (on b65 b404)
    (on b404 b78)
    (on-table b78)
    (clear b378)
    (on-table b378)
    (clear b379)
    (on b379 b217)
    (on b217 b280)
    (on-table b280)
    (clear b35)
    (on-table b35)
    (clear b385)
    (on b385 b134)
    (on-table b134)
    (clear b15)
    (on b15 b293)
    (on b293 b92)
    (on-table b92)
    (clear b168)
    (on b168 b300)
    (on b300 b346)
    (on-table b346)
    (clear b365)
    (on-table b365)
    (clear b305)
    (on b305 b369)
    (on-table b369)
    (clear b111)
    (on b111 b254)
    (on-table b254)
    (clear b270)
    (on b270 b353)
    (on b353 b50)
    (on b50 b207)
    (on b207 b47)
    (on b47 b306)
    (on b306 b366)
    (on b366 b402)
    (on b402 b53)
    (on b53 b212)
    (on b212 b376)
    (on b376 b230)
    (on-table b230)
    (clear b36)
    (on-table b36)
    (clear b223)
    (on b223 b342)
    (on b342 b119)
    (on b119 b370)
    (on b370 b54)
    (on b54 b335)
    (on-table b335)
    (clear b21)
    (on b21 b139)
    (on b139 b27)
    (on b27 b9)
    (on b9 b157)
    (on b157 b397)
    (on b397 b146)
    (on b146 b245)
    (on b245 b218)
    (on b218 b288)
    (on-table b288)
    (clear b103)
    (on-table b103)
    (clear b171)
    (on b171 b298)
    (on b298 b185)
    (on-table b185)
    (clear b304)
    (on b304 b391)
    (on b391 b323)
    (on b323 b360)
    (on-table b360)
    (clear b390)
    (on b390 b31)
    (on-table b31)
    (clear b357)
    (on b357 b273)
    (on b273 b197)
    (on b197 b269)
    (on b269 b320)
    (on b320 b287)
    (on b287 b190)
    (on-table b190)
    (clear b17)
    (on b17 b40)
    (on b40 b380)
    (on b380 b206)
    (on b206 b106)
    (on-table b106)
    (clear b363)
    (on b363 b362)
    (on-table b362)
    (clear b282)
    (on b282 b297)
    (on b297 b240)
    (on b240 b143)
    (on-table b143)
    (clear b315)
    (on b315 b18)
    (on b18 b231)
    (on b231 b246)
    (on b246 b90)
    (on b90 b350)
    (on b350 b308)
    (on-table b308)
    (clear b303)
    (on b303 b227)
    (on b227 b272)
    (on b272 b384)
    (on b384 b256)
    (on b256 b124)
    (on b124 b98)
    (on-table b98)
    (clear b34)
    (on b34 b182)
    (on b182 b126)
    (on-table b126)
    (clear b364)
    (on b364 b225)
    (on b225 b29)
    (on-table b29)
    (clear b26)
    (on b26 b67)
    (on b67 b276)
    (on-table b276)
    (clear b220)
    (on b220 b87)
    (on b87 b58)
    (on b58 b177)
    (on b177 b115)
    (on b115 b121)
    (on b121 b386)
    (on-table b386)
    (clear b332)
    (on-table b332)
    (clear b236)
    (on b236 b137)
    (on b137 b266)
    (on b266 b96)
    (on b96 b173)
    (on b173 b251)
    (on b251 b371)
    (on b371 b330)
    (on b330 b172)
    (on-table b172)
    (clear b205)
    (on b205 b278)
    (on-table b278)
    (clear b294)
    (on b294 b319)
    (on b319 b128)
    (on b128 b162)
    (on b162 b307)
    (on b307 b403)
    (on b403 b209)
    (on-table b209)
    (clear b141)
    (on b141 b401)
    (on b401 b311)
    (on b311 b55)
    (on b55 b186)
    (on-table b186)
    (clear b238)
    (on-table b238)
    (clear b152)
    (on b152 b160)
    (on b160 b344)
    (on b344 b341)
    (on b341 b28)
    (on b28 b368)
    (on b368 b201)
    (on b201 b104)
    (on b104 b127)
    (on-table b127)
    (clear b72)
    (on b72 b221)
    (on-table b221)
    (clear b337)
    (on b337 b382)
    (on b382 b286)
    (on b286 b202)
    (on-table b202)
    (clear b216)
    (on-table b216)
    (clear b80)
    (on b80 b174)
    (on b174 b367)
    (on-table b367)
    (clear b389)
    (on b389 b388)
    (on b388 b130)
    (on-table b130)
    (clear b333)
    (on b333 b324)
    (on b324 b396)
    (on b396 b194)
    (on b194 b374)
    (on b374 b198)
    (on b198 b94)
    (on-table b94)
    (clear b48)
    (on b48 b233)
    (on-table b233)
    (clear b117)
    (on b117 b132)
    (on-table b132)
    (clear b237)
    (on b237 b234)
    (on-table b234)
    (clear b322)
    (on b322 b61)
    (on-table b61)
    (clear b317)
    (on-table b317)
    (clear b301)
    (on b301 b309)
    (on-table b309)
    (clear b24)
    (on b24 b392)
    (on b392 b271)
    (on b271 b122)
    (on-table b122)
    (clear b89)
    (on b89 b81)
    (on-table b81)
    (clear b316)
    (on b316 b410)
    (on b410 b354)
    (on-table b354)
    (clear b261)
    (on b261 b355)
    (on b355 b281)
    (on b281 b310)
    (on b310 b211)
    (on b211 b63)
    (on b63 b155)
    (on b155 b178)
    (on b178 b109)
    (on b109 b37)
    (on b37 b265)
    (on-table b265)
    (clear b49)
    (on-table b49)
    (clear b290)
    (on b290 b57)
    (on b57 b260)
    (on-table b260)
    (clear b189)
    (on b189 b46)
    (on b46 b101)
    (on b101 b215)
    (on b215 b159)
    (on b159 b264)
    (on-table b264)
    (clear b30)
    (on-table b30)
    (clear b248)
    (on b248 b277)
    (on b277 b33)
    (on b33 b239)
    (on b239 b100)
    (on b100 b326)
    (on-table b326)
    (clear b302)
    (on-table b302)
    (clear b255)
    (on-table b255)
    (clear b318)
    (on b318 b393)
    (on b393 b400)
    (on b400 b153)
    (on b153 b6)
    (on b6 b56)
    (on b56 b66)
    (on b66 b39)
    (on b39 b361)
    (on-table b361)
    (clear b77)
    (on b77 b145)
    (on-table b145)
    (clear b149)
    (on-table b149)
    (clear b331)
    (on-table b331)
    (clear b140)
    (on b140 b74)
    (on b74 b263)
    (on-table b263)
    (clear b334)
    (on b334 b114)
    (on b114 b99)
    (on-table b99)
    (clear b135)
    (on b135 b44)
    (on-table b44)
    (clear b7)
    (on b7 b325)
    (on b325 b279)
    (on-table b279)
    (clear b243)
    (on b243 b129)
    (on b129 b60)
    (on b60 b275)
    (on b275 b347)
    (on b347 b249)
    (on-table b249)
    (clear b383)
    (on b383 b375)
    (on b375 b102)
    (on b102 b70)
    (on-table b70)
    (clear b20)
    (on-table b20)
    (clear b131)
    (on-table b131)
    (clear b395)
    (on-table b395)
    (clear b292)
    (on b292 b150)
    (on-table b150))
 (:goal  (and 
    (clear b10)
    (on b10 b9)
    (on b9 b8)
    (on b8 b2)
    (on b2 b5)
    (on-table b5)
    (clear b11)
    (on b11 b7)
    (on b7 b1)
    (on b1 b12)
    (on b12 b4)
    (on b4 b6)
    (on-table b6)
    (clear b3)
    (on-table b3))))

; plan
1. (unstack b123 b12)
   deleted: (on b123 b12) (clear b123) (arm-empty)
   added: (holding b123) (clear b12)
   goals met: 2 of 15
2. (putdown b123)
   deleted: (holding b123)
   added: (clear b123) (arm-empty) (on-table b123)
   goals met: 2 of 15
3. (unstack b133 b340)
   deleted: (on b133 b340) (clear b133) (arm-empty)
   added: (holding b133) (clear b340)
   goals met: 2 of 15
4. (putdown b133)
   deleted: (holding b133)
   added: (clear b133) (arm-empty) (on-table b133)
   goals met: 2 of 15
5. (unstack b156 b73)
   deleted: (on b156 b73) (clear b156) (arm-empty)
   added: (holding b156) (clear b73)
   goals met: 2 of 15
6. (putdown b156)
   deleted: (holding b156)
   added: (clear b156) (arm-empty) (on-table b156)
   goals met: 2 of 15
7. (unstack b158 b356)
   deleted: (on b158 b356) (clear b158) (arm-empty)
   added: (holding b158) (clear b356)
   goals met: 2 of 15
8. (putdown b158)
   deleted: (holding b158)
   added: (clear b158) (arm-empty) (on-table b158)
   goals met: 2 of 15
9. (unstack b176 b3)
   deleted: (on b176 b3) (clear b176) (arm-empty)
   added: (holding b176) (clear b3)
   goals met: 3 of 15
10. (putdown b176)
   deleted: (holding b176)
   added: (clear b176) (arm-empty) (on-table b176)
   goals met: 3 of 15
11. (unstack b21 b139)
   deleted: (on b21 b139) (clear b21) (arm-empty)
   added: (holding b21) (clear b139)
   goals met: 3 of 15
12. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 3 of 15
13. (unstack b139 b27)
   deleted: (on b139 b27) (clear b139) (arm-empty)
   added: (holding b139) (clear b27)
   goals met: 3 of 15
14. (putdown b139)
   deleted: (holding b139)
   added: (clear b139) (arm-empty) (on-table b139)
   goals met: 3 of 15
15. (unstack b27 b9)
   deleted: (on b27 b9) (clear b27) (arm-empty)
   added: (holding b27) (clear b9)
   goals met: 3 of 15
16. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 3 of 15
17. (unstack b318 b393)
   deleted: (on b318 b393) (clear b318) (arm-empty)
   added: (holding b318) (clear b393)
   goals met: 3 of 15
18. (putdown b318)
   deleted: (holding b318)
   added: (clear b318) (arm-empty) (on-table b318)
   goals met: 3 of 15
19. (unstack b340 b91)
   deleted: (on b340 b91) (clear b340) (arm-empty)
   added: (holding b340) (clear b91)
   goals met: 3 of 15
20. (putdown b340)
   deleted: (holding b340)
   added: (clear b340) (arm-empty) (on-table b340)
   goals met: 3 of 15
21. (unstack b356 b199)
   deleted: (on b356 b199) (clear b356) (arm-empty)
   added: (holding b356) (clear b199)
   goals met: 3 of 15
22. (putdown b356)
   deleted: (holding b356)
   added: (clear b356) (arm-empty) (on-table b356)
   goals met: 3 of 15
23. (unstack b199 b82)
   deleted: (on b199 b82) (clear b199) (arm-empty)
   added: (holding b199) (clear b82)
   goals met: 3 of 15
24. (putdown b199)
   deleted: (holding b199)
   added: (clear b199) (arm-empty) (on-table b199)
   goals met: 3 of 15
25. (unstack b38 b295)
   deleted: (on b38 b295) (clear b38) (arm-empty)
   added: (holding b38) (clear b295)
   goals met: 3 of 15
26. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 3 of 15
27. (unstack b295 b88)
   deleted: (on b295 b88) (clear b295) (arm-empty)
   added: (holding b295) (clear b88)
   goals met: 3 of 15
28. (putdown b295)
   deleted: (holding b295)
   added: (clear b295) (arm-empty) (on-table b295)
   goals met: 3 of 15
29. (unstack b393 b400)
   deleted: (on b393 b400) (clear b393) (arm-empty)
   added: (holding b393) (clear b400)
   goals met: 3 of 15
30. (putdown b393)
   deleted: (holding b393)
   added: (clear b393) (arm-empty) (on-table b393)
   goals met: 3 of 15
31. (unstack b400 b153)
   deleted: (on b400 b153) (clear b400) (arm-empty)
   added: (holding b400) (clear b153)
   goals met: 3 of 15
32. (putdown b400)
   deleted: (holding b400)
   added: (clear b400) (arm-empty) (on-table b400)
   goals met: 3 of 15
33. (unstack b153 b6)
   deleted: (on b153 b6) (clear b153) (arm-empty)
   added: (holding b153) (clear b6)
   goals met: 3 of 15
34. (putdown b153)
   deleted: (holding b153)
   added: (clear b153) (arm-empty) (on-table b153)
   goals met: 3 of 15
35. (unstack b6 b56)
   deleted: (on b6 b56) (clear b6) (arm-empty)
   added: (holding b6) (clear b56)
   goals met: 3 of 15
36. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 4 of 15
37. (unstack b73 b4)
   deleted: (on b73 b4) (clear b73) (arm-empty)
   added: (holding b73) (clear b4)
   goals met: 4 of 15
38. (putdown b73)
   deleted: (holding b73)
   added: (clear b73) (arm-empty) (on-table b73)
   goals met: 4 of 15
39. (unstack b82 b105)
   deleted: (on b82 b105) (clear b82) (arm-empty)
   added: (holding b82) (clear b105)
   goals met: 4 of 15
40. (putdown b82)
   deleted: (holding b82)
   added: (clear b82) (arm-empty) (on-table b82)
   goals met: 4 of 15
41. (unstack b105 b327)
   deleted: (on b105 b327) (clear b105) (arm-empty)
   added: (holding b105) (clear b327)
   goals met: 4 of 15
42. (putdown b105)
   deleted: (holding b105)
   added: (clear b105) (arm-empty) (on-table b105)
   goals met: 4 of 15
43. (unstack b327 b170)
   deleted: (on b327 b170) (clear b327) (arm-empty)
   added: (holding b327) (clear b170)
   goals met: 4 of 15
44. (putdown b327)
   deleted: (holding b327)
   added: (clear b327) (arm-empty) (on-table b327)
   goals met: 4 of 15
45. (unstack b170 b5)
   deleted: (on b170 b5) (clear b170) (arm-empty)
   added: (holding b170) (clear b5)
   goals met: 4 of 15
46. (putdown b170)
   deleted: (holding b170)
   added: (clear b170) (arm-empty) (on-table b170)
   goals met: 4 of 15
47. (unstack b5 b253)
   deleted: (on b5 b253) (clear b5) (arm-empty)
   added: (holding b5) (clear b253)
   goals met: 4 of 15
48. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 15
49. (unstack b88 b76)
   deleted: (on b88 b76) (clear b88) (arm-empty)
   added: (holding b88) (clear b76)
   goals met: 5 of 15
50. (putdown b88)
   deleted: (holding b88)
   added: (clear b88) (arm-empty) (on-table b88)
   goals met: 5 of 15
51. (unstack b76 b10)
   deleted: (on b76 b10) (clear b76) (arm-empty)
   added: (holding b76) (clear b10)
   goals met: 6 of 15
52. (putdown b76)
   deleted: (holding b76)
   added: (clear b76) (arm-empty) (on-table b76)
   goals met: 6 of 15
53. (unstack b91 b147)
   deleted: (on b91 b147) (clear b91) (arm-empty)
   added: (holding b91) (clear b147)
   goals met: 6 of 15
54. (putdown b91)
   deleted: (holding b91)
   added: (clear b91) (arm-empty) (on-table b91)
   goals met: 6 of 15
55. (unstack b147 b409)
   deleted: (on b147 b409) (clear b147) (arm-empty)
   added: (holding b147) (clear b409)
   goals met: 6 of 15
56. (putdown b147)
   deleted: (holding b147)
   added: (clear b147) (arm-empty) (on-table b147)
   goals met: 6 of 15
57. (unstack b409 b247)
   deleted: (on b409 b247) (clear b409) (arm-empty)
   added: (holding b409) (clear b247)
   goals met: 6 of 15
58. (putdown b409)
   deleted: (holding b409)
   added: (clear b409) (arm-empty) (on-table b409)
   goals met: 6 of 15
59. (unstack b247 b328)
   deleted: (on b247 b328) (clear b247) (arm-empty)
   added: (holding b247) (clear b328)
   goals met: 6 of 15
60. (putdown b247)
   deleted: (holding b247)
   added: (clear b247) (arm-empty) (on-table b247)
   goals met: 6 of 15
61. (unstack b328 b250)
   deleted: (on b328 b250) (clear b328) (arm-empty)
   added: (holding b328) (clear b250)
   goals met: 6 of 15
62. (putdown b328)
   deleted: (holding b328)
   added: (clear b328) (arm-empty) (on-table b328)
   goals met: 6 of 15
63. (unstack b250 b381)
   deleted: (on b250 b381) (clear b250) (arm-empty)
   added: (holding b250) (clear b381)
   goals met: 6 of 15
64. (putdown b250)
   deleted: (holding b250)
   added: (clear b250) (arm-empty) (on-table b250)
   goals met: 6 of 15
65. (unstack b381 b213)
   deleted: (on b381 b213) (clear b381) (arm-empty)
   added: (holding b381) (clear b213)
   goals met: 6 of 15
66. (putdown b381)
   deleted: (holding b381)
   added: (clear b381) (arm-empty) (on-table b381)
   goals met: 6 of 15
67. (unstack b213 b229)
   deleted: (on b213 b229) (clear b213) (arm-empty)
   added: (holding b213) (clear b229)
   goals met: 6 of 15
68. (putdown b213)
   deleted: (holding b213)
   added: (clear b213) (arm-empty) (on-table b213)
   goals met: 6 of 15
69. (unstack b229 b120)
   deleted: (on b229 b120) (clear b229) (arm-empty)
   added: (holding b229) (clear b120)
   goals met: 6 of 15
70. (putdown b229)
   deleted: (holding b229)
   added: (clear b229) (arm-empty) (on-table b229)
   goals met: 6 of 15
71. (unstack b120 b2)
   deleted: (on b120 b2) (clear b120) (arm-empty)
   added: (holding b120) (clear b2)
   goals met: 6 of 15
72. (putdown b120)
   deleted: (holding b120)
   added: (clear b120) (arm-empty) (on-table b120)
   goals met: 6 of 15
73. (unstack b1 b8)
   deleted: (on b1 b8) (clear b1) (arm-empty)
   added: (holding b1) (clear b8)
   goals met: 6 of 15
74. (stack b1 b12)
   deleted: (clear b12) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b12)
   goals met: 7 of 15
75. (unstack b2 b19)
   deleted: (on b2 b19) (clear b2) (arm-empty)
   added: (holding b2) (clear b19)
   goals met: 7 of 15
76. (stack b2 b5)
   deleted: (clear b5) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b5)
   goals met: 8 of 15
77. (unstack b4 b399)
   deleted: (on b4 b399) (clear b4) (arm-empty)
   added: (holding b4) (clear b399)
   goals met: 8 of 15
78. (stack b4 b6)
   deleted: (clear b6) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b6)
   goals met: 9 of 15
79. (unstack b7 b325)
   deleted: (on b7 b325) (clear b7) (arm-empty)
   added: (holding b7) (clear b325)
   goals met: 9 of 15
80. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 10 of 15
81. (unstack b8 b321)
   deleted: (on b8 b321) (clear b8) (arm-empty)
   added: (holding b8) (clear b321)
   goals met: 10 of 15
82. (stack b8 b2)
   deleted: (clear b2) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b2)
   goals met: 11 of 15
83. (unstack b9 b157)
   deleted: (on b9 b157) (clear b9) (arm-empty)
   added: (holding b9) (clear b157)
   goals met: 11 of 15
84. (stack b9 b8)
   deleted: (clear b8) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b8)
   goals met: 12 of 15
85. (unstack b10 b407)
   deleted: (on b10 b407) (clear b10) (arm-empty)
   added: (holding b10) (clear b407)
   goals met: 11 of 15
86. (stack b10 b9)
   deleted: (clear b9) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b9)
   goals met: 13 of 15
87. (unstack b7 b1)
   deleted: (on b7 b1) (clear b7) (arm-empty)
   added: (holding b7) (clear b1)
   goals met: 12 of 15
88. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 12 of 15
89. (unstack b1 b12)
   deleted: (on b1 b12) (clear b1) (arm-empty)
   added: (holding b1) (clear b12)
   goals met: 11 of 15
90. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 11 of 15
91. (unstack b12 b16)
   deleted: (on b12 b16) (clear b12) (arm-empty)
   added: (holding b12) (clear b16)
   goals met: 11 of 15
92. (stack b12 b4)
   deleted: (clear b4) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b4)
   goals met: 12 of 15
93. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 12 of 15
94. (stack b1 b12)
   deleted: (clear b12) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b12)
   goals met: 13 of 15
95. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 13 of 15
96. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 14 of 15
97. (unstack b11 b274)
   deleted: (on b11 b274) (clear b11) (arm-empty)
   added: (holding b11) (clear b274)
   goals met: 13 of 15
98. (stack b11 b7)
   deleted: (clear b7) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b7)
   goals met: 15 of 15
